In [1]:
import pandas as pd

In [2]:
muestra=pd.read_csv('../data/muestra.csv')

muestra.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             107 non-null    int64
 1   salary_in_usd  107 non-null    int64
dtypes: int64(2)
memory usage: 1.8 KB

In [3]:
testeo=pd.read_csv('../data/testeo.csv')

testeo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           107 non-null    int64
 1   experience_level    107 non-null    object
 2   employment_type     107 non-null    object
 3   job_title           107 non-null    object
 4   salary              107 non-null    int64
 5   salary_currency     107 non-null    object
 6   employee_residence  107 non-null    object
 7   remote_ratio        107 non-null    int64
 8   company_location    107 non-null    object
 9   company_size        107 non-null    object
dtypes: int64(3), object(7)
memory usage: 8.5+ KB

In [4]:
salary=pd.read_csv('../data/salaries_data.csv')

salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           500 non-null    int64
 1   experience_level    500 non-null    object
 2   employment_type     500 non-null    object
 3   job_title           500 non-null    object
 4   salary              500 non-null    int64
 5   salary_currency     500 non-null    object
 6   salary_in_usd       500 non-null    int64
 7   employee_residence  500 non-null    object
 8   remote_ratio        500 non-null    int64
 9   company_location    500 non-null    object
 10  company_size        500 non-null    object
dtypes: int64(4), object(7)
memory usage: 43.1+ KB

In [5]:
pd.set_option('display.max_columns', None)

In [6]:
pd.set_option('display.max_rows', None)

In [7]:
salary.experience_level.unique()

array(['SE', 'MI', 'EN', 'EX'], dtype=object)

In [8]:

experience_level={'SE': 2, 'MI': 1, 'EN': 0, 'EX':3}

def cambio_exp(x):   
    return experience_level[x]

salary.experience_level=salary.experience_level.apply(lambda x: experience_level[x])

salary.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,2,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,2,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,1,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,1,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,1,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [9]:
testeo.experience_level=testeo.experience_level.apply(lambda x: experience_level[x])

testeo.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2020,2,FT,Machine Learning Scientist,260000,USD,JP,0,JP,S
1,2020,1,FT,Lead Data Analyst,87000,USD,US,100,US,L
2,2020,1,FT,Data Analyst,85000,USD,US,100,US,L
3,2020,1,FT,Machine Learning Engineer,299000,CNY,CN,0,CN,M
4,2020,1,FT,Product Data Analyst,450000,INR,IN,100,IN,L

In [10]:
salary.employment_type.unique()

array(['FT', 'CT', 'FL', 'PT'], dtype=object)

In [11]:
employment_type={'FT': 3, 'CT': 1, 'FL': 0, 'PT':2}

def cambio_exp(x):   
    return employment_type[x]

salary.employment_type=salary.employment_type.apply(lambda x: employment_type[x])

salary.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,2,3,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,2,3,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,1,3,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,1,1,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,1,3,Data Engineer,22000,EUR,26005,RO,0,US,L

In [12]:
testeo.employment_type=testeo.employment_type.apply(lambda x: employment_type[x])

testeo.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2020,2,3,Machine Learning Scientist,260000,USD,JP,0,JP,S
1,2020,1,3,Lead Data Analyst,87000,USD,US,100,US,L
2,2020,1,3,Data Analyst,85000,USD,US,100,US,L
3,2020,1,3,Machine Learning Engineer,299000,CNY,CN,0,CN,M
4,2020,1,3,Product Data Analyst,450000,INR,IN,100,IN,L

In [13]:
#Eliminamos las columnas salary y salary_currency

In [14]:
salary.drop(columns=['salary','salary_currency','employee_residence'], inplace=True)

In [15]:
testeo.drop(columns=['salary','salary_currency','employee_residence'], inplace=True)

In [16]:
salary.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,2,3,Data Engineer,140250,100,US,M
1,2022,2,3,Data Engineer,135000,100,US,M
2,2021,1,3,BI Data Analyst,100000,100,US,M
3,2021,1,1,ML Engineer,270000,100,US,L
4,2021,1,3,Data Engineer,26005,0,US,L

In [17]:
salary.job_title.unique()

array(['Data Engineer', 'BI Data Analyst', 'ML Engineer',
       'Machine Learning Scientist', 'Data Scientist', 'Data Analyst',
       'Machine Learning Engineer', 'Principal Data Scientist',
       'Data Engineering Manager', 'Data Analytics Manager',
       'Big Data Engineer', 'Research Scientist',
       'Machine Learning Developer', 'Computer Vision Engineer',
       'AI Scientist', 'Machine Learning Manager', 'Lead Data Scientist',
       'Director of Data Science', '3D Computer Vision Researcher',
       'Data Specialist', 'Applied Data Scientist',
       'Data Science Engineer', 'Head of Data', 'Analytics Engineer',
       'ETL Developer', 'Marketing Data Analyst', 'Data Architect',
       'Data Science Consultant', 'Principal Data Analyst',
       'Head of Data Science', 'Lead Data Engineer',
       'Data Science Manager', 'Applied Machine Learning Scientist',
       'Lead Data Analyst', 'Cloud Data Engineer',
       'Lead Machine Learning Engineer',
       'Machine Learning Infrastructure Engineer', 'Big Data Architect',
       'Product Data Analyst', 'Business Data Analyst',
       'Director of Data Engineering', 'Data Analytics Lead',
       'Financial Data Analyst', 'Finance Data Analyst',
       'Head of Machine Learning', 'Staff Data Scientist',
       'Data Analytics Engineer', 'Computer Vision Software Engineer'],
      dtype=object)

In [18]:
def job_title(x):
    if 'Machine' in x or 'ML' in x or 'Computer' in x:
        return 'Machine Learning'
    if 'Engineer' in x or 'Engineering' in x:
        return 'Data Engineer'
    if 'Analyst' in x or 'Analytics' in x:
        return 'Data Analyst'
    else:
        return 'Data Scientist'

In [19]:
salary.job_title=salary.job_title.apply(job_title)

In [20]:
testeo.job_title=testeo.job_title.apply(job_title)

In [21]:
salary.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,2,3,Data Engineer,140250,100,US,M
1,2022,2,3,Data Engineer,135000,100,US,M
2,2021,1,3,Data Analyst,100000,100,US,M
3,2021,1,1,Machine Learning,270000,100,US,L
4,2021,1,3,Data Engineer,26005,0,US,L

In [22]:
salary.company_size.unique()

array(['M', 'L', 'S'], dtype=object)

In [23]:
company_size={'M': 1, 'L': 2, 'S': 0}

def cambio_size(x):   
    return company_size[x]

salary.company_size=salary.company_size.apply(lambda x: company_size[x])

salary.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,2,3,Data Engineer,140250,100,US,1
1,2022,2,3,Data Engineer,135000,100,US,1
2,2021,1,3,Data Analyst,100000,100,US,1
3,2021,1,1,Machine Learning,270000,100,US,2
4,2021,1,3,Data Engineer,26005,0,US,2

In [24]:
testeo.company_size=testeo.company_size.apply(lambda x: company_size[x])

testeo.head()

,work_year,experience_level,employment_type,job_title,remote_ratio,company_location,company_size
0,2020,2,3,Machine Learning,0,JP,0
1,2020,1,3,Data Analyst,100,US,2
2,2020,1,3,Data Analyst,100,US,2
3,2020,1,3,Machine Learning,0,CN,1
4,2020,1,3,Data Analyst,100,IN,2

In [25]:
salary.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2022,2,3,Data Engineer,140250,100,US,1
1,2022,2,3,Data Engineer,135000,100,US,1
2,2021,1,3,Data Analyst,100000,100,US,1
3,2021,1,1,Machine Learning,270000,100,US,2
4,2021,1,3,Data Engineer,26005,0,US,2

In [26]:
salary.remote_ratio.unique()

array([100,   0,  50])

In [27]:
def company_location(x):
    if 'US' in x:
        return '1'
    else:
        return '2'

In [28]:
salary.company_location=salary.company_location.apply(company_location)

In [29]:
testeo.company_location=testeo.company_location.apply(company_location)

In [30]:
from sklearn.preprocessing import LabelEncoder

In [31]:
salary.job_title=LabelEncoder().fit_transform(salary.job_title)

In [32]:
testeo.job_title=LabelEncoder().fit_transform(testeo.job_title)

In [33]:
salary.work_year=LabelEncoder().fit_transform(salary.work_year)

In [34]:
testeo.work_year=LabelEncoder().fit_transform(testeo.work_year)

In [35]:
salary.salary_in_usd=LabelEncoder().fit_transform(salary.salary_in_usd)

In [36]:
salary.remote_ratio=LabelEncoder().fit_transform(salary.remote_ratio)

In [37]:
testeo.remote_ratio=LabelEncoder().fit_transform(testeo.remote_ratio)

In [38]:
testeo.job_title=LabelEncoder().fit_transform(testeo.job_title)

In [39]:
salary.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2,2,3,1,228,2,1,1
1,2,2,3,1,219,2,1,1
2,1,1,3,0,166,2,1,1
3,1,1,1,3,302,2,1,2
4,1,1,3,1,32,0,1,2

In [40]:
testeo.head()

,work_year,experience_level,employment_type,job_title,remote_ratio,company_location,company_size
0,0,2,3,3,0,2,0
1,0,1,3,0,2,1,2
2,0,1,3,0,2,1,2
3,0,1,3,3,0,2,1
4,0,1,3,0,2,2,2

In [ ]:
# salary.company_location=LabelEncoder().fit_transform(salary.company_location)

In [ ]:
# testeo.company_location=LabelEncoder().fit_transform(testeo.company_location)

In [41]:
salary.company_location.value_counts()

1    296
2    204
Name: company_location, dtype: int64

In [42]:
salary.company_location.value_counts()

1    296
2    204
Name: company_location, dtype: int64

In [43]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         500 non-null    int64
 1   experience_level  500 non-null    int64
 2   employment_type   500 non-null    int64
 3   job_title         500 non-null    int64
 4   salary_in_usd     500 non-null    int64
 5   remote_ratio      500 non-null    int64
 6   company_location  500 non-null    object
 7   company_size      500 non-null    int64
dtypes: int64(7), object(1)
memory usage: 31.4+ KB

In [44]:
salary['company_location'] = salary['company_location'].astype('int')

In [45]:
testeo['company_location'] = testeo['company_location'].astype('int')

In [46]:
testeo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         107 non-null    int64
 1   experience_level  107 non-null    int64
 2   employment_type   107 non-null    int64
 3   job_title         107 non-null    int64
 4   remote_ratio      107 non-null    int64
 5   company_location  107 non-null    int64
 6   company_size      107 non-null    int64
dtypes: int64(7)
memory usage: 6.0 KB

In [ ]:
#from sklearn.preprocessing import StandardScaler

#scaler=StandardScaler()

#salary[['work_year', 'salary_in_usd','experience_level', 'employment_type', 'job_title','remote_ratio','company_location','company_size']]=scaler.fit_transform(salary[['work_year', 'salary_in_usd','experience_level','employment_type', 'job_title','remote_ratio','company_location','company_size']])

#salary.head()

In [47]:
from sklearn.preprocessing import StandardScaler

scaler=StandardScaler()

salary[['salary_in_usd']]=scaler.fit_transform(salary[['salary_in_usd']])

salary.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2,2,3,1,0.719390,2,1,1
1,2,2,3,1,0.614099,2,1,1
2,1,1,3,0,-0.005943,2,1,1
3,1,1,1,3,1.585109,2,1,2
4,1,1,3,1,-1.573597,0,1,2

In [48]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         500 non-null    int64
 1   experience_level  500 non-null    int64
 2   employment_type   500 non-null    int64
 3   job_title         500 non-null    int64
 4   salary_in_usd     500 non-null    float64
 5   remote_ratio      500 non-null    int64
 6   company_location  500 non-null    int64
 7   company_size      500 non-null    int64
dtypes: float64(1), int64(7)
memory usage: 31.4 KB

In [49]:
salary['salary_in_usd'] = salary['salary_in_usd'].astype('int')

In [50]:
testeo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   work_year         107 non-null    int64
 1   experience_level  107 non-null    int64
 2   employment_type   107 non-null    int64
 3   job_title         107 non-null    int64
 4   remote_ratio      107 non-null    int64
 5   company_location  107 non-null    int64
 6   company_size      107 non-null    int64
dtypes: int64(7)
memory usage: 6.0 KB

In [ ]:
#testeo[['work_year','experience_level', 'employment_type', 'job_title','remote_ratio','company_location','company_size']]=scaler.fit_transform(testeo[['work_year','experience_level','employment_type', 'job_title','remote_ratio','company_location','company_size']])

#testeo.head()

In [ ]:
#Install lazypredict
#%pip install lazypredict

In [51]:
#Import Lazypredict and all libraries
import lazypredict
from lazypredict.Supervised import LazyRegressor
from sklearn.model_selection import train_test_split
import os
import pandas as pd
import numpy as np

In [52]:
testeo.head()

,work_year,experience_level,employment_type,job_title,remote_ratio,company_location,company_size
0,0,2,3,3,0,2,0
1,0,1,3,0,2,1,2
2,0,1,3,0,2,1,2
3,0,1,3,3,0,2,1
4,0,1,3,0,2,2,2

In [53]:
salary.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,remote_ratio,company_location,company_size
0,2,2,3,1,0,2,1,1
1,2,2,3,1,0,2,1,1
2,1,1,3,0,0,2,1,1
3,1,1,1,3,1,2,1,2
4,1,1,3,1,-1,0,1,2

In [54]:
salary_x=salary.drop('salary_in_usd', axis=1)
salary_y=salary.salary_in_usd

In [55]:
from sklearn.model_selection import train_test_split as tts

In [56]:
X_train, X_test, y_train, y_test = tts(salary_x, salary_y,train_size=0.9, test_size=0.1,random_state =42)

In [57]:
lazy = LazyRegressor(verbose=0,ignore_warnings=True, custom_metric=None)
models, predictions = lazy.fit(X_train, X_test, y_train, y_test)

100%|| 42/42 [00:01<00:00, 26.36it/s]

In [58]:
print(models)

                               Adjusted R-Squared  R-Squared  RMSE  Time Taken
Model
KNeighborsRegressor                          0.06       0.20  0.45        0.01
LGBMRegressor                                0.06       0.19  0.45        0.14
HistGradientBoostingRegressor                0.06       0.19  0.45        0.10
TweedieRegressor                             0.05       0.18  0.46        0.00
BaggingRegressor                             0.02       0.16  0.46        0.02
MLPRegressor                                -0.00       0.14  0.47        0.18
NuSVR                                       -0.01       0.14  0.47        0.02
AdaBoostRegressor                           -0.01       0.14  0.47        0.03
OrthogonalMatchingPursuit                   -0.01       0.14  0.47        0.00
GradientBoostingRegressor                   -0.01       0.13  0.47        0.02
SVR                                         -0.02       0.13  0.47        0.02
RandomForestRegressor                       -0.04       0.11  0.48        0.07
LassoLarsCV                                 -0.08       0.08  0.49        0.01
LarsCV                                      -0.08       0.08  0.49        0.01
ElasticNetCV                                -0.08       0.08  0.49        0.02
LassoCV                                     -0.08       0.07  0.49        0.02
BayesianRidge                               -0.10       0.06  0.49        0.01
RidgeCV                                     -0.10       0.06  0.49        0.01
SGDRegressor                                -0.11       0.05  0.49        0.00
KernelRidge                                 -0.11       0.05  0.49        0.01
OrthogonalMatchingPursuitCV                 -0.11       0.05  0.49        0.01
Ridge                                       -0.11       0.04  0.49        0.00
TransformedTargetRegressor                  -0.12       0.04  0.50        0.00
LinearRegression                            -0.12       0.04  0.50        0.00
Lars                                        -0.12       0.04  0.50        0.00
LassoLarsIC                                 -0.12       0.04  0.50        0.00
LinearSVR                                   -0.12       0.04  0.50        0.01
HuberRegressor                              -0.14       0.02  0.50        0.01
XGBRegressor                                -0.17      -0.01  0.51        0.16
ExtraTreeRegressor                          -0.18      -0.01  0.51        0.00
QuantileRegressor                           -0.18      -0.01  0.51        0.56
DummyRegressor                              -0.19      -0.02  0.51        0.00
ElasticNet                                  -0.19      -0.02  0.51        0.00
LassoLars                                   -0.19      -0.02  0.51        0.00
Lasso                                       -0.19      -0.02  0.51        0.00
GaussianProcessRegressor                    -0.20      -0.03  0.51        0.02
ExtraTreesRegressor                         -0.26      -0.08  0.53        0.06
DecisionTreeRegressor                       -0.40      -0.20  0.56        0.00
PassiveAggressiveRegressor                  -0.79      -0.53  0.63        0.00
RANSACRegressor                             -7.78      -6.53  1.39        0.02

In [ ]:
# X_train, X_test, y_train, y_test = tts(salary_x, salary_y, train_size=0.8, test_size=0.2, random_state=50)

# X_train.shape, X_test.shape, y_train.shape, y_test.shape

%pip install xgboost
%pip install catboost
%pip install lightgbm

In [ ]:
from sklearn.linear_model import LinearRegression as LinReg
from sklearn.linear_model import Lasso        # regularizacion L1
from sklearn.linear_model import Ridge        # regularizacion L2
from sklearn.linear_model import ElasticNet
from sklearn.svm import SVR
from sklearn.ensemble import RandomForestRegressor as RFR  
from sklearn.tree import ExtraTreeRegressor as ETR
from sklearn.ensemble import GradientBoostingRegressor as GBR
from xgboost import XGBRegressor as XGBR
from catboost import CatBoostRegressor as CTR

In [ ]:
from lightgbm import LGBMRegressor as LGBMR

In [ ]:
# se inician los modelos
linreg=LinReg()
lasso=Lasso()
ridge=Ridge()
elastic=ElasticNet()
svr=SVR()
rfr=RFR()
etr=ETR()
gbr=GBR()
xgbr=XGBR()
ctr=CTR()
lgbmr=LGBMR()

In [ ]:
#crear columna con las medias de los salarios por pais. ponderacion

**Entrenamos modelos**

In [ ]:
linreg.fit(X_train, y_train)
lasso.fit(X_train, y_train)
ridge.fit(X_train, y_train)
elastic.fit(X_train, y_train)
svr.fit(X_train, y_train)
rfr.fit(X_train, y_train)
etr.fit(X_train, y_train)
gbr.fit(X_train, y_train)
xgbr.fit(X_train, y_train)
ctr.fit(X_train, y_train)
lgbmr.fit(X_train, y_train)

**Prediccion**

In [ ]:
y_pred_lineal=linreg.predict(X_test)

In [ ]:
y_pred_lasso=lasso.predict(X_test)

In [ ]:
y_pred_ridge=ridge.predict(X_test)

In [ ]:
y_pred_elastic=elastic.predict(X_test)

In [ ]:
y_pred_svr=svr.predict(X_test)

In [ ]:
y_pred_rfr=rfr.predict(X_test)

In [ ]:
y_pred_etr=etr.predict(X_test)

In [ ]:
y_pred_gbr=gbr.predict(X_test)

In [ ]:
y_pred_xgbr=xgbr.predict(X_test)

In [ ]:
y_pred_ctr=ctr.predict(X_test)

In [ ]:
y_pred_lgbmr=lgbmr.predict(X_test)

**evaluacin**

In [ ]:
from sklearn.metrics import mean_squared_error as mse

In [ ]:
# regresion lineal

y_pred=linreg.predict(X_test)

mse(y_test, y_pred, squared=False)

In [ ]:
# lasso

y_pred=lasso.predict(X_test)

mse(y_test, y_pred, squared=False)

In [ ]:
# ridge

y_pred=ridge.predict(X_test)

mse(y_test, y_pred, squared=False)

In [ ]:
# elastic

y_pred=elastic.predict(X_test)

mse(y_test, y_pred, squared=False)

In [ ]:
# svr

y_pred=svr.predict(X_test)

mse(y_test, y_pred, squared=False)  # RMSE

In [ ]:
# rfr

y_pred=rfr.predict(X_test)

mse(y_test, y_pred, squared=False)  # RMSE

In [ ]:
# etr

y_pred=etr.predict(X_test)

mse(y_test, y_pred, squared=False)  # RMSE

In [ ]:
#gbr
y_pred=gbr.predict(X_test)

mse(y_test, y_pred, squared=False)

In [ ]:
#gbr
y_pred=gbr.predict(salary_x)

mse(salary_y, y_pred, squared=False)

In [ ]:
#xgbr

y_pred=xgbr.predict(X_test)

mse(y_test, y_pred, squared=False)  # RMSE

In [ ]:
#ctr
y_pred=ctr.predict(X_test)

mse(y_test, y_pred, squared=False)  # RMSE

In [ ]:
#lgbmr
y_pred=lgbmr.predict(X_test)

mse(y_test, y_pred, squared=False)  # RMSE

**Lo llevo al archivo Testeo**

In [ ]:
y_test.info()

In [ ]:
testeo.info()

In [ ]:
pred_lin=linreg.predict(testeo)

In [ ]:
pred_las=lasso.predict(testeo)

In [ ]:
pred_las=pd.DataFrame(pred_las, columns=['salary_in_usd'])
pred_las.to_csv('lasso.csv',index_label='id')

In [ ]:
pred_rid=ridge.predict(testeo)

In [ ]:
pred_rid=pd.DataFrame(pred_rid, columns=['salary_in_usd'])
pred_rid.to_csv('rid.csv',index_label='id')

In [ ]:
pred_elas=elastic.predict(testeo)

In [ ]:
pred_svr=svr.predict(testeo)

In [ ]:
pred_svr=pd.DataFrame(pred_svr, columns=['salary_in_usd'])
pred_svr.to_csv('svr.csv',index_label='id')

In [ ]:
pred_rfr=rfr.predict(testeo)

In [ ]:
pred_etr=etr.predict(testeo)

In [ ]:
pred_gbr=gbr.predict(testeo)

In [ ]:
pred_gbr=pd.DataFrame(pred_gbr, columns=['salary_in_usd'])
pred_gbr.to_csv('gbr.csv',index_label='id')

In [ ]:
pred_xgbr=xgbr.predict(testeo)

In [ ]:
pred_ctr=ctr.predict(testeo)

In [ ]:
pred_lgbmr=lgbmr.predict(testeo)